app/views/employees/_form.html.erb

SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC
---

    <%= form.collection_select :company_id, Company.order(:name),:id,:name, include_blank: true %>

SELECT "departments".* FROM "departments" ORDER BY "departments"."name" ASC
---

    <%= form.collection_select :department_id, Department.order(:name),:id,:name, include_blank: true %>