app/helpers/demos_helper.rb

SELECT "companies"."name", "companies"."id" FROM "companies"
---
  def companies
    companies = Company.all
    companies.pluck(:name,:id)

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."company_id" = ?  [["company_id", 1]]
SELECT "departments"."name", "departments"."id" FROM "departments" WHERE "departments"."company_id" = ?  [["company_id", 1]]
---
  def departments(company)
    departments = Company.find(company).departments
    departments.pluck(:name,:id)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "employees"."name", "employees"."id" FROM "employees" WHERE "employees"."department_id" = ?  [["department_id", 1]]
---
  def employees(company, department)
    employees = Department.find(department).employees
    employees.pluck(:name,:id)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def emp_details(employee)
    employee = Employee.find(employee)