app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "emp_number", "emp_details", "address", "company_id", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)